app/views/admin/index.html.erb

    <%= f.text_field :phone, placeholder: "Phone" %><br />
    <%= f.select :role, User.roles.keys.map { |w| [w.humanize, w] }, include_blank:
---
SELECT "users".* FROM "users"