app/controllers/admin_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "role", "username", "phone") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "updated_at" = ?, "role" = ?, "username" = ?, "phone" = ? WHERE "users"."id" = ?  [["updated_at", "2024-02-28 15:38:43.910684"], ["role", 0], ["username", "user10"], ["phone", "3131234124124314"], ["id", 1]]
---
  def update
    if @user.update(user_params)