app/controllers/book_posts_controller.rb

  def create
    @book_post = current_user.book_posts.build(book_post_params)
    if @book_post.save
---
INSERT INTO "book_posts" ("title", "author", "genre", "isbn", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @book_post.update(book_post_params)
---
UPDATE "book_posts" SET "title" = ?, "updated_at" = ? WHERE "book_posts"."id" = ?  [["title", "geyhyreyer"], ["updated_at", "2024-02-19 15:00:57.189578"], ["id", 1]]

  def destroy
    @book_post.destroy
---
DELETE FROM "book_posts" WHERE "book_posts"."id" = ?  [["id", 3]]

  def set_book_post
    @book_post = BookPost.find(params[:id])
---
SELECT "book_posts".* FROM "book_posts" WHERE "book_posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]