app/controllers/pages_controller.rb

SELECT "book_posts".* FROM "book_posts" ORDER BY LOWER(title) desc
---
  def index
    if params[:order] == "asc"
      @book_posts = BookPost.order("LOWER(title) asc")