app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def verify_otp
    verifier = Rails.application.message_verifier(:otp_session)
    user_id = verifier.verify(session[:otp_token])
    user = User.find(user_id)

UPDATE "users" SET "updated_at" = ?, "otp_secret" = ? WHERE "users"."id" = ?  [["updated_at", "2024-03-06 13:14:16.850341"], ["otp_secret", "[FILTERED]"], ["id", 16]]
---
  def enable_otp_show_qr
    # Render the QR code page
    if current_user.otp_required_for_login
      redirect_to edit_user_registration_path, alert: '2FA is already enabled'
    else
      current_user.otp_secret = User.generate_otp_secret
      issuer = 'Your app'
      label = "#{issuer}:#{current_user.email}"

      @provisioning_uri = current_user.otp_provisioning_uri(label, issuer: issuer)
      puts Rails.application.credentials.config[:active_record_encryption][:primary_key] # Debug line
      current_user.save!

UPDATE "users" SET "updated_at" = ?, "otp_required_for_login" = ? WHERE "users"."id" = ?  [["updated_at", "2024-03-06 13:15:57.920926"], ["otp_required_for_login", "[FILTERED]"], ["id", 16]]
---
  def enable_otp_verify
    if current_user.validate_and_consume_otp!(params[:otp_attempt])
      current_user.otp_required_for_login = true
      current_user.save!